<template>
  <div class="centering">
    当サイトは個人によるファンサイトであり、
    <br />
    あらゆる企業・団体と関係がありません。
    <br />
    <br />
    計算結果に責任は持てませんので
    <br />
    ご了承の上ご利用ください。
    <br />
    <br />
    <h2>このツールでわかること</h2>
    ・目標ptまでに必要なライブ回数
    <br />
    ・目標ptまでに必要な時間
    <br />
    ・目標ptまでに必要なダイヤ数
    <br />
    ・現在のptから目標ptまでに必要なライブ回数
    <br />
    ・現在のptから目標ptまでに必要な時間
    <br />
    ・現在のptから目標ptまでに必要なダイヤ数
    <br />
    <h2>注意点</h2>
    ・ランクアップ、自然回復分のBPは考慮していません

    <h2>更新履歴</h2>
    2024-07-14: 1.1.1 細かな改善を実施<br/>
    2024-07-13: 1.1.0 箱イベ用ロジックの追加<br/>
    2024-07-07: 1.0.0 ツアーイベント用ロジックのリリース<br/>
  </div>
</template>

<style scoped>
.centering {
  margin-top: 10px;
  text-align: center;
}
</style>
